MusaMahmood/nRF52_ADS1292_2CH_ECG/pca10040/s132/arm5_no_packs/ads1291-2.h
/** @file
 *
 * @brief Functions for initializing and controlling Texas Instruments ADS1291/2 analog front-end.
 */

#ifndef ADS1291_2_H__
#define ADS1291_2_H__

#include "ble_eeg.h"
#include "nrf_drv_spi.h"
#include <stdint.h>

//#ifdef __cplusplus
//extern "C" {
//#endif

#ifdef BOARD_PCA10028
#define ADS1291_2_PWDN_PIN 4  /**< ADS1291 power-down/reset pin - A3 on Arduino */
#define ADS1291_2_DRDY_PIN 15 /**< ADS1291 data ready interrupt pin - D3 on Arduino */
#elif defined(BOARD_2CH_ECG_RAT)
#define ADS1291_2_PWDN_PIN 16 /**< ADS1291 power-down/reset pin */
#define ADS1291_2_DRDY_PIN 11 /**< ADS1291 data ready interrupt pin */
#define ADS1291_2_SCK_PIN 13
#define ADS1291_2_MOSI_PIN 14
#define ADS1291_2_MISO_PIN 12
#define ADS1291_2_SS_PIN 15
#endif

/**
 *	\brief Error codes for interacting with the ADS1291_2.
 *
 */
typedef enum {
  ADS1291_2_STATUS_OK = 0,         ///< No error.
  ADS1291_2_ERROR_SPI_TIMEOUT = 1, ///< SPI timed out. Check SPI configuration and hardware connections.
                                   /* Expand with other codes if desired */
} ads1291_2_error_t;

#define ADS1291_2_NUM_REGS 12

/**
 *	\brief ADS1291_2 register addresses.
 *
 * Consult the ADS1291/2 datasheet and user's guide for more information.
 */
#define ADS1291_2_REGADDR_ID 0x00        ///< Chip ID register. Read-only.
#define ADS1291_2_REGADDR_CONFIG1 0x01   ///< Configuration register 1. Controls conversion mode and data rate.
#define ADS1291_2_REGADDR_CONFIG2 0x02   ///< Configuration register 2. Controls LOFF comparator, reference, CLK pin, and test signal.
#define ADS1291_2_REGADDR_LOFF 0x03      ///< Lead-off control register. Controls lead-off frequency, magnitude, and threshold.
#define ADS1291_2_REGADDR_CH1SET 0x04    ///< Channel 1 settings register. Controls channel 1 input mux, gain, and power-down.
#define ADS1291_2_REGADDR_CH2SET 0x05    ///< Channel 2 settings register (ADS1292x only). Controls channel 2 input mux, gain, and power-down.
#define ADS1291_2_REGADDR_RLD_SENS 0x06  ///< RLD sense selection. Controls PGA chop frequency, RLD buffer, and channels for RLD derivation.
#define ADS1291_2_REGADDR_LOFF_SENS 0x07 ///< Lead-off sense selection. Controls current direction and selects channels that will use lead-off detection.
#define ADS1291_2_REGADDR_LOFF_STAT 0x08 ///< Lead-off status register. Bit 6 controls clock divider. For bits 4:0, 0: lead on, 1: lead off.
#define ADS1291_2_REGADDR_RESP1 0x09     ///< Respiration 1 (ADS1292R only). See datasheet.
#define ADS1291_2_REGADDR_RESP2 0x0A     ///< Respiration 2. Controls offset calibration, respiration modulator freq, and RLDREF signal source.
#define ADS1291_2_REGADDR_GPIO 0x0B      ///< GPIO register. Controls state and direction of the ADS1291_2 GPIO pins.
/**
 *	\brief ADS1291/2 SPI communication opcodes.
 *	
 * Consult the ADS1291/2 datasheet and user's guide for more information.
 * For RREG and WREG opcodes, the first byte (opcode) must be ORed with the address of the register to be read/written. 
 * The command is completed with a second byte 000n nnnn, where n nnnn is (# registers to read) - 1.
 */
#define ADS1291_2_OPC_WAKEUP 0x02    ///< Wake up from standby.
#define ADS1291_2_OPC_STANDBY 0x04   ///< Enter standby.
#define ADS1291_2_OPC_RESET 0x06     ///< Reset all registers.
#define ADS1291_2_OPC_START 0x08     ///< Start data conversions.
#define ADS1291_2_OPC_STOP 0x0A      ///< Stop data conversions.
#define ADS1291_2_OPC_OFFSETCAL 0x1A ///< Calibrate channel offset. RESP2.CALIB_ON must be 1. Execute after every PGA gain change.

#define ADS1291_2_OPC_RDATAC 0x10 ///< Read data continuously (registers cannot be read or written in this mode).
#define ADS1291_2_OPC_SDATAC 0x11 ///< Stop continuous data read.
#define ADS1291_2_OPC_RDATA 0x12  ///< Read single data value.

#define ADS1291_2_OPC_RREG 0x20 ///< Read register value. System must not be in RDATAC mode.
#define ADS1291_2_OPC_WREG 0x40 ///< Write register value. System must not be in RDATAC mode.

/* ID REGISTER ********************************************************************/

/**
 *  \brief Factory-programmed device ID for ADS1291/2.
 */
#define ADS1291_DEVICE_ID 0x52
#define ADS1292_DEVICE_ID 0x53
#define ADS1292R_DEVICE_ID 0x73

/* CONFIG1 REGISTER ***************************************************************/

/**
 *  \brief Bit mask definitions for CONFIG1.SINGLE_SHOT (single-shot or continuous conversion setting).
 *
 */
#define ADS1291_2_REG_CONFIG1_CONTINUOUS_CONVERSION_MODE (0 << 7)
#define ADS1291_2_REG_CONFIG1_SINGLE_SHOT_MODE (1 << 7)

/**
 *  \brief Bit mask definitions for CONFIG1.DR (data rate).
 *
 * FMOD = 128 kHz (FCLK/4 for FCLK = 512 kHz, FCLK/16 for FCLK = 2.048 MHz).
 */
#define ADS1291_2_REG_CONFIG1_FMOD_DIV_BY_1024 0 ///< Data is output at FMOD/1024, or 125 SPS.
#define ADS1291_2_REG_CONFIG1_125_SPS 0
#define ADS1291_2_REG_CONFIG1_FMOD_DIV_BY_512 1 ///< Data is output at FMOD/512, or 250 SPS.
#define ADS1291_2_REG_CONFIG1_250_SPS 1
#define ADS1291_2_REG_CONFIG1_FMOD_DIV_BY_256 2 ///< Data is output at FMOD/256, or 500 SPS.
#define ADS1291_2_REG_CONFIG1_500_SPS 2
#define ADS1291_2_REG_CONFIG1_FMOD_DIV_BY_128 3 ///< Data is output at FMOD/128, or 1000 SPS.
#define ADS1291_2_REG_CONFIG1_1000_SPS 3
#define ADS1291_2_REG_CONFIG1_FMOD_DIV_BY_64 4 ///< Data is output at FMOD/64, or 2000 SPS.
#define ADS1291_2_REG_CONFIG1_2000_SPS 4
#define ADS1291_2_REG_CONFIG1_FMOD_DIV_BY_32 5 ///< Data is output at FMOD/32, or 4000 SPS.
#define ADS1291_2_REG_CONFIG1_4000_SPS 5
#define ADS1291_2_REG_CONFIG1_FMOD_DIV_BY_16 6 ///< Data is output at FMOD/16, or 8000 SPS.
#define ADS1291_2_REG_CONFIG1_8000_SPS 6

/**
 *  \brief Combined value of reserved bits in CONFIG1 register.
 *
 * Consult the ADS1291_2 datasheet, page 40, for more information.
 */
#define ADS1291_2_REG_CONFIG1_RESERVED_VALUE 0

/* CONFIG2 REGISTER ***************************************************************/

/**
 *  \brief Bit mask definitions for CONFIG2.TEST_FREQ (test signal frequency).
 */
#define ADS1291_2_REG_CONFIG2_TEST_SIGNAL_DC 0   ///< Test signal is not pulsed.
#define ADS1291_2_REG_CONFIG2_TEST_SIGNAL_1_HZ 1 ///< Test signal is pulsed at 1 Hz.

/**
 *  \brief Bit mask definitions for CONFIG2.INT_TEST (test signal on/off).
 */
#define ADS1291_2_REG_CONFIG2_CAL_AMP_VREF_DIV_2_4_MV (0 << 1)  ///< Calibration signal amplitude is 1 x (VREFP - VREFN)/(2.4 mV).
#define ADS1291_2_REG_CONFIG2_CAL_AMP_2VREF_DIV_2_4_MV (1 << 1) ///< Calibration signal amplitude is 2 x (VREFP - VREFN)/(2.4 mV).

/**
 *  \brief Bit location and size definitions for CONFIG2.CLK_EN bit (oscillator output on CLK pin en/disabled).
 *
 * Consult the ADS1291_2 datasheet, page 40, for more information.
 */
#define ADS1291_2_REG_CONFIG2_CLOCK_OUTPUT_DISABLED (0 << 3)
#define ADS1291_2_REG_CONFIG2_CLOCK_OUTPUT_ENABLED (1 << 3)

/**
 *  \brief Bit mask definitions for CONFIG2.VREF_4V (reference voltage).
 */
#define ADS1291_2_REG_CONFIG2_VREF_2V42 (0 << 4)  ///< Internal voltage reference is 2.42 V.
#define ADS1291_2_REG_CONFIG2_VREF_4V033 (1 << 4) ///< Internal voltage reference is 4.033 V (only for AVDD = 5V).

/**
 *  \brief Bit mask definitions for CONFIG2.PDB_REFBUF (internal voltage reference buffer enable/disable).
 *
 * Note that disabling the buffer for the internal voltage reference requires that a reference voltage
 * must be externally applied on VREFP for proper operation.
 */
#define ADS1291_2_REG_CONFIG2_REFBUF_DISABLED (0 << 5)
#define ADS1291_2_REG_CONFIG2_REFBUF_ENABLED (1 << 5)

/**
 *  \brief Bit mask definitions for CONFIG2.PDB_LOFF_COMP (power-down lead-off comparators).
 *
 */
#define ADS1291_2_REG_CONFIG2_LEAD_OFF_DISABLED (0 << 6)
#define ADS1291_2_REG_CONFIG2_LEAD_OFF_ENABLED (1 << 6)

/**
 *  \brief Combined value of reserved bits in CONFIG2 register.
 *
 * Consult the ADS1291/2 datasheet, page 41, for more information.
 */
#define ADS1291_2_REG_CONFIG2_RESERVED_VALUE (1 << 7)

/* LOFF REGISTER ******************************************************************/

/**
 *  \brief Bit mask definitions for LOFF.COMP_TH (lead-off comparator threshold).
 *
 * Definition names are for the positive side (LOFFP). The corresponding LOFFN thresholds
 * are the difference between these thresholds and 100%. Default value is _95_PERCENT.
 */
#define ADS1291_2_REG_LOFF_95_PERCENT (0 << 5)
#define ADS1291_2_REG_LOFF_92_5_PERCENT (1 << 5)
#define ADS1291_2_REG_LOFF_90_PERCENT (2 << 5)
#define ADS1291_2_REG_LOFF_87_5_PERCENT (3 << 5)
#define ADS1291_2_REG_LOFF_85_PERCENT (4 << 5)
#define ADS1291_2_REG_LOFF_80_PERCENT (5 << 5)
#define ADS1291_2_REG_LOFF_75_PERCENT (6 << 5)
#define ADS1291_2_REG_LOFF_70_PERCENT (7 << 5)

/**
 *  \brief Bit mask definitions for LOFF.ILEAD_OFF (lead-off current magnitude).
 *
 * This should be as small as possible for continuous lead-off detection, so as not to noticeably alter
 * the acquired signal. Default is _6_NA.
 */
#define ADS1291_2_REG_LOFF_6_NA (0 << 2)  ///< 6 nA lead-off current.
#define ADS1291_2_REG_LOFF_22_NA (1 << 2) ///< 24 nA lead-off current.
#define ADS1291_2_REG_LOFF_6_UA (2 << 2)  ///< 6 uA lead-off current.
#define ADS1291_2_REG_LOFF_22_UA (3 << 2) ///< 24 uA lead-off current.

/**
 *  \brief Bit mask definitions for LOFF.FLEAD_OFF (lead-off current frequency).
 *
 * This should be as large as possible for continuous AC lead-off detection to ensure that it is out
 * of the frequency band of interest. The excitation signal can then be filtered out of the acquired
 * overall signal, and its voltage amplitude measured in order to determine the electrode impedance.
 * FCLK is the clock frequency of the ADS1291/2. This is normally 512 kHz.
 * FDR is the output data rate. With the default clock, this must be at least 1 kHz in order to use
 * continuous AC impedance monitoring, since the excitation frequency of FDR/4 = 250 Hz is the lowest
 * possible frequency outside of the EEG band. If only a specific band is needed and it is lower than
 * 62.5 Hz or 125 Hz, the 250/500 Hz settings may be used.
 */
#define ADS1291_2_REG_LOFF_DC_LEAD_OFF 0           ///< Lead-off current is at DC.
#define ADS1291_2_REG_LOFF_AC_LEAD_OFF_FDR_DIV_4 1 ///< Lead-off current is at FDR/4.

/**
 *  \brief Combined value of reserved bits in LOFF register.
 *
 */
#define ADS1291_2_REG_LOFF_RESERVED_VALUE (1 << 4)

