MusaMahmood/nRF52_ADS1292_2CH_ECG/pca10040/s132/arm5_no_packs/ads1291-2.h
/* CHnSET REGISTERS *************************************************************/

/**
 *  \brief Bit mask definitions for CHnSET.PD (channel power-down).
 */
#define ADS1291_2_REG_CHNSET_CHANNEL_ON (0 << 7)
#define ADS1291_2_REG_CHNSET_CHANNEL_OFF (1 << 7)

/**
 *  \brief Bit mask definitions for CHnSET.GAIN (channel PGA gain).
 *
 * Take care to ensure that the gain is appropriate for the common-mode level of the device inputs.
 * Higher gain settings have lower input-referred noise.
 * Consult the ADS1291/2 datasheet, pages 7-9 and 20-22, for more information.
 */
#define ADS1291_2_REG_CHNSET_GAIN_1 (1 << 4)  ///< PGA gain = 1.
#define ADS1291_2_REG_CHNSET_GAIN_2 (2 << 4)  ///< PGA gain = 2.
#define ADS1291_2_REG_CHNSET_GAIN_3 (3 << 4)  ///< PGA gain = 4.
#define ADS1291_2_REG_CHNSET_GAIN_4 (4 << 4)  ///< PGA gain = 6.
#define ADS1291_2_REG_CHNSET_GAIN_6 (0 << 4)  ///< PGA gain = 8.
#define ADS1291_2_REG_CHNSET_GAIN_8 (5 << 4)  ///< PGA gain = 12.
#define ADS1291_2_REG_CHNSET_GAIN_12 (6 << 4) ///< PGA gain = 24.

/**
 *  \brief Bit mask definitions for CHnSET.MUX (channel mux setting).
 *
 * Controls the channel multiplexing on the ADS1291/2.
 * Consult the ADS1291/2 datasheet, pages 17-19, for more information.
 */
#define ADS1291_2_REG_CHNSET_NORMAL_ELECTRODE 0   ///< Channel is connected to the corresponding positive and negative input pins.
#define ADS1291_2_REG_CHNSET_INPUT_SHORTED 1      ///< Channel inputs are shorted together. Used for offset and noise measurements.
#define ADS1291_2_REG_CHNSET_RLD_MEASUREMENT 2    ///< Used to measure RLD signal.
#define ADS1291_2_REG_CHNSET_MVDD_SUPPLY 3        ///< Used for measuring analog and digital supplies. See ADS1291/2 datasheet, p. 19.
#define ADS1291_2_REG_CHNSET_TEMPERATURE_SENSOR 4 ///< Measures device temperature. See ADS1291/2 datasheet, p. 19.
#define ADS1291_2_REG_CHNSET_TEST_SIGNAL 5        ///< Measures calibration signal. See ADS1291/2 datasheet, pp. 17 and 41.
#define ADS1291_2_REG_CHNSET_RLD_DRP 6            ///< Connects positive side of channel to RLD output.
#define ADS1291_2_REG_CHNSET_RLD_DRM 7            ///< Connects negative side of channel to RLD output.
#define ADS1291_2_REG_CHNSET_RLD_DRPM 8           ///< Connects both sides of channel to RLD output.
#define ADS1291_2_REG_CHNSET_IN3 9                ///< Connects INxP/INxM of channel to IN3P/IN3M, respectively.

/**
 *  \brief Combined value of reserved bits in CHnSET registers.
 *
 */
#define ADS1291_2_REG_CHNSET_RESERVED_VALUE 0

/* RLD_SENS REGISTER **************************************************************/

/**
 *  \brief Bit mask definitions for RLD_SENS.CHOP (PGA chop frequency).
 */
#define ADS1291_2_REG_RLD_SENS_CHOP_FMOD_DIV_16 (0 << 6)
#define ADS1291_2_REG_RLD_SENS_CHOP_FMOD_DIV_2 (2 << 6)
#define ADS1291_2_REG_RLD_SENS_CHOP_FMOD_DIV_4 (3 << 6)

/**
 *  \brief Bit mask definitions for RLD_SENS.PDB_RLD (power-down or enable RLD buffer amplifier).
 */
#define ADS1291_2_REG_RLD_SENS_RLDBUF_DISABLED (0 << 5)
#define ADS1291_2_REG_RLD_SENS_RLDBUF_ENABLED (1 << 5)

/**
 *  \brief Bit mask definitions for RLD_SENS.RLD_LOFF_SENS (detection of RLD lead-off en/disable).
 */
#define ADS1291_2_REG_RLD_SENS_LOFF_SENSE_DISABLED (0 << 4)
#define ADS1291_2_REG_RLD_SENS_LOFF_SENSE_ENABLED (1 << 4)

/**
 *  \brief Bit mask definitions for RLD_SENS.RLDxy (channels for RLD derivation).
 *
 * Consult the ADS1291/2 datasheet, page 45, for more information.
 */
#define ADS1291_2_REG_RLD_SENS_RLD2N_ENABLED (1 << 3)
#define ADS1291_2_REG_RLD_SENS_RLD2N_DISABLED (0 << 3)
#define ADS1291_2_REG_RLD_SENS_RLD2P_ENABLED (1 << 2)
#define ADS1291_2_REG_RLD_SENS_RLD2P_DISABLED (0 << 2)
#define ADS1291_2_REG_RLD_SENS_RLD1N_ENABLED (1 << 1)
#define ADS1291_2_REG_RLD_SENS_RLD1N_DISABLED (0 << 1)
#define ADS1291_2_REG_RLD_SENS_RLD1P_ENABLED (1 << 0)
#define ADS1291_2_REG_RLD_SENS_RLD1P_DISABLED (0 << 0)

/**
 *  \brief Combined value of reserved bits in RLD_SENS register.
 *
 */
#define ADS1291_2_REG_RLD_SENS_RESERVED_VALUE 0

/* LOFF_SENS REGISTER *************************************************************/

/**
 *  \brief Bit mask definitions for LOFF_SENS.FLIP2 (current direction for CH2 LOFF).
 */
#define ADS1291_2_REG_LOFF_SENS_CH2_PSOURCE_NSINK (0 << 5)
#define ADS1291_2_REG_LOFF_SENS_CH2_PSINK_NSOURCE (1 << 5)

/**
 *  \brief Bit mask definitions for LOFF_SENS.FLIP1 (current direction for CH1 LOFF).
 */
#define ADS1291_2_REG_LOFF_SENS_CH1_PSOURCE_NSINK (0 << 4)
#define ADS1291_2_REG_LOFF_SENS_CH1_PSINK_NSOURCE (1 << 4)

/**
 *  \brief Bit mask definitions for LOFF_SENS register.
 *
 * Consult the ADS1291/2 datasheet, page 46, for more information.
 */
#define ADS1291_2_REG_LOFF_SENS_LOFF2N_ENABLED (1 << 3)
#define ADS1291_2_REG_LOFF_SENS_LOFF2N_DISABLED (0 << 3)
#define ADS1291_2_REG_LOFF_SENS_LOFF2P_ENABLED (1 << 2)
#define ADS1291_2_REG_LOFF_SENS_LOFF2P_DISABLED (0 << 2)
#define ADS1291_2_REG_LOFF_SENS_LOFF1N_ENABLED (1 << 1)
#define ADS1291_2_REG_LOFF_SENS_LOFF1N_DISABLED (0 << 1)
#define ADS1291_2_REG_LOFF_SENS_LOFF1P_ENABLED (1 << 0)
#define ADS1291_2_REG_LOFF_SENS_LOFF1P_DISABLED (0 << 0)

/**
 *  \brief Combined value of reserved bits in LOFF_SENS register.
 *
 */
#define ADS1291_2_REG_LOFF_SENS_RESERVED_VALUE 0

/* LOFF_STAT REGISTER *************************************************************/
/**
 *  \brief Bit mask definitions for LOFF_STAT.CLK_DIV (modulation clock division ratio).
 */
#define ADS1291_2_REG_LOFF_STAT_FMOD_IS_FCLK_DIV_4 (0 << 6)
#define ADS1291_2_REG_LOFF_STAT_FMOD_IS_FCLK_DIV_16 (1 << 6)

/**
 *  \brief Bit mask definitions for LOFF_STAT (read-only).
 *
 * Consult the ADS1291/2 datasheet, page 47, for more information.
 */
#define ADS1291_2_REG_LOFF_STAT_RLD_OFF (1 << 4)
#define ADS1291_2_REG_LOFF_STAT_IN2N_OFF (1 << 3)
#define ADS1291_2_REG_LOFF_STAT_IN2P_OFF (1 << 2)
#define ADS1291_2_REG_LOFF_STAT_IN1N_OFF (1 << 1)
#define ADS1291_2_REG_LOFF_STAT_IN1P_OFF (1 << 0)

/**
 *  \brief Combined value of reserved bits in LOFF_STAT register.
 *
 */
#define ADS1291_2_REG_LOFF_STAT_RESERVED_VALUE 0

/* RESP1 REGISTER *****************************************************************/

/* RESP1 controls respiration functionality that is:
 * 				1) only present in the ADS1292R
 *				2) not supported by the current board design
 * Therefore this register is currently unimplemented by the present API.
 */

/**
 *  \brief Combined value of reserved bits in RESP1 register.
 *
 */
#define ADS1291_2_REG_RESP1_RESERVED_VALUE 0x02

/* RESP2 REGISTER *****************************************************************/

/**
 *  \brief Bit mask definitions for RESP2.CALIB_ON (offset calibration en/disable).
 */
#define ADS1291_2_REG_RESP2_OFFSET_CALIB_OFF (0 << 7)
#define ADS1291_2_REG_RESP2_OFFSET_CALIB_ON (1 << 7)

/**
 *  \brief Bit mask definitions for RESP2.RESP_FREQ (respiration modulation frequency, ADS1292R only).
 *
 * This is included only for completeness's sake. Current hardware doesn't support respiration monitoring.
 * This bit must be a '1' for ADS1291 and ADS1292 (64 kHz).
 */
#define ADS1291_2_REG_RESP2_RESP_FREQ_32_KHZ (0 << 2)
#define ADS1291_2_REG_RESP2_RESP_FREQ_64_KHZ (1 << 2)

/**
 *  \brief Bit mask definitions for RESP2.RLDREF_INT (RLD reference internally or externally generated).
 */
#define ADS1291_2_REG_RESP2_RLDREF_EXT (0 << 1)
#define ADS1291_2_REG_RESP2_RLDREF_INT (1 << 1)

/**
 *  \brief Combined value of reserved bits in RESP2 register.
 */
#define ADS1291_2_REG_RESP2_RESERVED_VALUE 0x01

/* GPIO REGISTER ******************************************************************/
/**
 *  \brief Bit mask definitions for GPIO.GPIODn (GPIO direction bits).
 *
 * The ADS1291/2 have 2 GPIO pins that can be manipulated via the SPI bus if there are not enough
 * GPIO pins available on the host.
 * GPIOD[2:1] controls the logic levels on GPIO pins 2:1.
 *
 * Consult the ADS1291/2 datasheet, page 49, for more information.
 */
#
#define ADS1291_2_REG_GPIO_GPIOD2_LOW (0 << 3)
#define ADS1291_2_REG_GPIO_GPIOD2_HIGH (1 << 3)
#define ADS1291_2_REG_GPIO_GPIOD1_LOW (0 << 2)
#define ADS1291_2_REG_GPIO_GPIOD1_HIGH (1 << 2)

/**
 *  \brief Bit mask definitions for GPIO.GPIOCn (GPIO level).
 *
 * The ADS1291/2 have 2 GPIO pins that can be manipulated via the SPI bus if there are not enough
 * GPIO pins available on the host.
 * GPIOC[2:1] controls the pin direction on GPIO pins 2:1.
 *
 * Consult the ADS1291/2 datasheet, page 49, for more information.
 */
#define ADS1291_2_REG_GPIO_GPIOC2_OUTPUT (0 << 1)
#define ADS1291_2_REG_GPIO_GPIOC2_INPUT (1 << 1)
#define ADS1291_2_REG_GPIO_GPIOC1_OUTPUT (0 << 0)
#define ADS1291_2_REG_GPIO_GPIOC1_INPUT (1 << 0)

/**
 *  \brief Combined value of reserved bits in GPIO register.
 *
 */
#define ADS1291_2_REG_GPIO_RESERVED_VALUE 0

/* DEFAULT REGISTER VALUES ********************************************************/

#define ADS1291_2_REGDEFAULT_CONFIG1 0x06   ///< Continuous conversion, data rate = 125->8kSPS
#define ADS1291_2_REGDEFAULT_CONFIG2 0xA3   ///< LOFF off, REFBUF on, VREF=2.42, CLK_EN=0, INT_TEST=1, TEST_FREQ @ 1Hz
#define ADS1291_2_REGDEFAULT_LOFF 0x00      ///< 95%/5% LOFF comparator threshold, DC lead-off at 6 nA
#define ADS1291_2_REGDEFAULT_CH1SET 0x60    ///< Channel on, G=12, normal electrode
#define ADS1291_2_REGDEFAULT_CH2SET 0x60    ///< Channel off, G=1, input short
#define ADS1291_2_REGDEFAULT_RLD_SENS 0x23  ///< Chop @ fmod/16, RLD buffer on, LOFF off, RLD derivation from CH1 P+N
#define ADS1291_2_REGDEFAULT_LOFF_SENS 0x00 ///< Current source @ IN+, sink @ IN-, all LOFF channels disconnected
#define ADS1291_2_REGDEFAULT_LOFF_STAT 0x00 ///< Fmod = fclk/4 (for fclk = 512 kHz)
#define ADS1291_2_REGDEFAULT_RESP1 0x02     ///< Resp measurement disabled
#define ADS1291_2_REGDEFAULT_RESP2 0x07     ///< Offset calibration disabled, RLD internally generated
#define ADS1291_2_REGDEFAULT_GPIO 0x00      ///< All GPIO set to output, logic low
/**@TYPEDEFS: */
typedef int16_t body_voltage_t;

