MusaMahmood/nRF52_ADS1292_2CH_ECG/pca10040/s132/arm5_no_packs/ads1291-2.h
typedef struct {
  uint8_t a;
  uint8_t b;
  uint8_t c;
} eeg_values_t; //full 24-bit values:

/**************************************************************************************************************************************************
*               Prototypes                                                                                                                        *
**************************************************************************************************************************************************/
void ads_spi_init(void);
/**
 *	\brief Initialize the ADS1291/2.
 *
 * This function performs the power-on reset and initialization procedure documented on page 58 of the
 * ADS1291_2 datasheet, up to "Send SDATAC Command."
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_init_regs(void);

/**
 *	\brief Read a single register from the ADS1291_2.
 *
 * This function sends the RREG opcode, logical OR'd with the specified register address, and
 * writes the obtained register value to a variable. This command will have no effect if the 
 * device is in continuous read mode.
 *
 * \pre Requires spi.h from the Atmel Software Framework.
 * \param reg_addr The register address of the register to be read.
 * \param num_to_read The number of registers to read, starting at @param(reg_addr).
 * \param read_reg_val_ptr Pointer to the variable to store the read register value(s).
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_rreg(uint8_t reg_addr, uint8_t num_to_read, uint8_t *read_reg_val_ptr);

/**
 *	\brief Write a single register on the ADS1291_2.
 *
 * This function sends the WREG opcode, logical OR'd with the specified register address, and
 * then writes the specified value to that register. This command will have no effect if the 
 * device is in continuous read mode.
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \param reg_addr The register address of the register to be written.
 * \param num_to_write The number of registers to write, starting at @param(reg_addr).
 * \param write_reg_val_ptr The value(s) to be written to the specified register.
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_wreg(uint8_t reg_addr, uint8_t num_to_write, uint8_t *write_reg_val_ptr);

/**
 *	\brief Put the ADS1291_2 in standby mode.
 *
 * This function sends the STANDBY opcode to the ADS1291_2. This places the device in a low-power mode by
 * shutting down all parts of the circuit except for the reference section. Return from standby using 
 * ads1291_2_wake(). Do not send any other commands during standby mode.
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_standby(void);

/**
 *	\brief Wake the ADS1291_2 from standby mode.
 *
 * This function sends the WAKEUP opcode to the ADS1291_2. This returns the device to normal operation 
 * after entering standby mode using ads1291_2_standby(). The host must wait 4 ADS1291_2 clock cycles
 * (approximately 2 us at 2.048 MHz) after sending this opcode to allow the device to wake up. 
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_wake(void);

#ifdef ADS1291_2_START_PIN
/**
 *	\brief Start analog-to-digital conversion on the ADS1291/2 by setting the START pin.
 *
 * This function pulls the START pin high, which begins analog-to-digital conversion on the ADS1291/2.
 * If conversions are already in progress, this has no effect. Pulling the START pin low 
 * ads1291_2_hard_stop_conversion() must follow this command by at least 4 ADS1291/2 clock cycles 
 * (approximately 8 us at 512 kHz). This command should not be used if ads1291_2_soft_start_conversion() 
 * has been used but has not yet been followed by ads1291_2_soft_stop_conversion().
 *
 * \pre Requires nrf_gpio.h from the nRF51 SDK.
 */
void ads1291_2_hard_start_conversion(void);

/**
 *	\brief Stop analog-to-digital conversion on the ADS1291/2 by clearing the START pin.
 *
 * This function pulls the START pin low, which halts analog-to-digital conversion on the ADS1291/2.
 * This command must follow pulling the START pin high ads1291_2_hard_start_conversion() by at least 
 * 4 ADS1291/2 clock cycles (approximately 8 us at 512 kHz).
 *
 * \pre Requires nrf_gpio.h from the nRF51 SDK.
 */
void ads1291_2_hard_stop_conversion(void);
#endif // ADS1291_2_START_PIN

/**
 *	\brief Start analog-to-digital conversion on the ADS1291/2 using the START opcode.
 *
 * This function sends the START opcode, which begins analog-to-digital conversion on the ADS1291/2.
 * It is provided in case the START pin is not available for use in the user application.
 * If conversions are already in progress, this has no effect. The STOP command ads1291_2_soft_stop_conversion()
 * must follow this command by at least 4 ADS1291/2 clock cycles (approximately 8 us at 512 kHz). 
 * This command should not be used if ads1291_2_hard_start_conversion() has not yet been followed by 
 * ads1291_2_hard_stop_conversion().
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_soft_start_conversion(void);

/**
 *	\brief Stop analog-to-digital conversion on the ADS1291/2 using the STOP opcode.
 *
 * This function sends the STOP opcode, which halts analog-to-digital conversion on the ADS1291/2.
 * It is provided in case the START pin is not available for use in the user application.
 * This command must follow a START opcode ads1291_2_soft_start_conversion() by at least 4 ADS1291/2
 * clock cycles (approximately 8 us at 512 kHz). This command should not be used if 
 * ads1291_2_hard_start_conversion() has not yet been followed by ads1291_2_hard_stop_conversion().
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_soft_stop_conversion(void);

/**
 *	\brief Enable continuous data output.
 *
 * This function sends the RDATAC opcode, which makes conversion data immediately available
 * to the host as soon as the DRDY pin goes low. The host need only send SCLKs to retrieve
 * the data, rather than starting with a RDATA command. Registers cannot be read or written
 * (RREG or WREG) in this mode. Cancel continuous read mode using ads1291_2_stop_rdatac().
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \return Zero if successful, or an error code if unsuccessful.
 */
//uint32_t ads1291_2_start_rdatac(void);
void ads1291_2_start_rdatac(void);
/**
 *	\brief Disable continuous data output.
 *
 * This function sends the SDATAC opcode, which exits the continuous data mode.
 *
 * \pre Requires spi_master.h from the nRF51 SDK.
 * \return Zero if successful, or an error code if unsuccessful.
 */
void ads1291_2_stop_rdatac(void);

void ads1291_2_calibrate(void);

void ads1291_2_powerdn(void);

void ads1291_2_powerup(void);

void ads1291_2_soft_reset(void);

void ads1291_2_check_id(void);

/**@DATA RETRIEVAL FUNCTIONS****/

void set_sampling_rate(uint8_t sampling_rate);

void get_eeg_voltage_array_2ch(ble_eeg_t *p_eeg);

void get_eeg_voltage_array_2ch_low_resolution(ble_eeg_t *p_eeg);

void ads_spi_uninit(void);

void ads_spi_init_with_sample_freq(uint8_t spi_sclk);
//#ifdef __cplusplus
//}
//#endif
#endif // ADS1291_2_H__